Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
        sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
        kprint(msg);
        
        sprintf(msg, "sector: %08lX\n", ((flash_ptr - 0x08000000)/FLASH_SECTOR_SIZE));
        kprint(msg);
        
        return BL_WRITE_ERROR;
    }

    return BL_OK;
}

/**
 * @brief  Finish flash programming: this function finalizes the flash
 *         programming by locking the flash.
 * @see    README for futher information
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK is returned in every case
 */
uint8_t Bootloader_FlashEnd(void)
{
    /* Lock flash */
    HAL_FLASH_Lock();
    __HAL_FLASH_CLEAR_FLAG(FLASH_SR_EOP | FLASH_SR_WRPERR | FLASH_SR_PROGERR);

    return BL_OK;
}

/**
 * @brief  This function returns the protection status of the application area flash.
 * @return true if application area is protected
 */
uint8_t Bootloader_GetProtectionStatus(void)
  {
  #define WITHIN(N,L,H)       ((N) >= (L) && (N) <= (H))
  
  if (app_size) {
    
    uint8_t last_app_page = ((app_size/FLASH_SECTOR_SIZE) + last_boot_page);
    if (app_size % FLASH_SECTOR_SIZE) last_app_page++;  // include partial page
    
    if (wrp1a_end >= wrp1a_strt) {
      // CASE A - wrp1a starts in app area
      if (WITHIN(wrp1a_strt, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE B - wrp1a ends in application area
      if (WITHIN(wrp1a_end, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE C - application entirely within wrp1a
      if (WITHIN(last_app_page, wrp1a_strt, wrp1a_end)) {
        return 1;
      }
    }  // end wrp1a

    
    if (wrp1b_end >= wrp1b_strt) {
      // CASE A - wrp1b starts in app area
      if (WITHIN(wrp1b_strt, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE B - wrp1b ends in application area
      if (WITHIN(wrp1b_end, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE C - application entirely within wrp1b
      if (WITHIN(last_app_page, wrp1b_strt, wrp1b_end)) {
        return 1;
      }
    }  // end wrp1b

      
    if (wrp2a_end >= wrp2a_strt) {
      // CASE A - wrp2a starts in app area
      if (WITHIN(wrp2a_strt + 128, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE B - wrp2a ends in application area
      if (WITHIN(wrp2a_end + 128, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE C - application entirely within wrp2a
      if (WITHIN(last_app_page, wrp2a_strt + 128, wrp2a_end + 128)) {
        return 1;
      }
    }  // end wrp2a
   
      
    if (wrp2b_end >= wrp2b_strt) {
      // CASE A - wrp2b starts in app area
      if (WITHIN(wrp2b_strt + 128, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE B - wrp2b ends in application area
      if (WITHIN(wrp2b_end + 128, last_boot_page + 1, last_app_page)) {
        return 1;
      }
      // CASE C - application entirely within wrp2b
      if (WITHIN(last_app_page, wrp2b_strt + 128, wrp2b_end + 128)) {
        return 1;
      }
    }  // end wrp2b

  }  // app size
  return 0;
}

// debug helper routine
const char *byte_to_binary (uint32_t x)
{
    static char b[33];
    b[0] = '\0';

    uint32_t z;
    for (z = 1 << 31; z > 0; z >>= 1)
    {
        strcat(b, ((x & z) == z) ? "1" : "0");
    }

    return b;
}


/**
 * @brief  This function configures the write protection of flash.
 * @param  protection: protection type ::eFlashProtectionTypes
 * @retval BL_OK: 

 *
 * Setting the protection is a five step process
 *   1) Determine final proection
 *   2) Disable protection on desired sectors
 *   3) Enable protection on all other sectors
 *   4) Invoke HAL_FLASH_OB_Launch()
 *   5) Send the system through reset so that the new settings take effect
 * 
 */
 
uint8_t Bootloader_ConfigProtection_Set(uint32_t *data) {  
   /*           @arg @ref OB_WRPAREA_ZONE_A Flash Zone A
  *           @arg @ref OB_WRPAREA_ZONE_B Flash Zone B
  *           @arg @ref OB_WRPAREA_ZONE2_A Flash Bank 2 Zone A (*)
  *           @arg @ref OB_WRPAREA_ZONE2_B Flash Bank 2 Zone B (*)
  * @note  (*) availability depends on devices
  * @param  WRPStartOffset  Specifies the start page of the write protected area
  *         This parameter can be page number between 0 and (max number of pages in the Flash Bank - 1)
  * @param  WRDPEndOffset  Specifies the end page of the write protected area
  *         This parameter can be page number between WRPStartOffset and (max number of pages in the Flash Bank - 1)
  * @retval None
  */
//FLASH_OB_WRPConfig(OB_WRPAREA_ZONE_A, 5, 20);
//FLASH_OB_WRPConfig(OB_WRPAREA_ZONE_B, 45, 90);

//FLASH_OBProgramInitTypeDef pOBInit ={0};
//HAL_FLASHEx_OBGetConfig(&pOBInit);
//
//pOBInit.OptionType = OPTIONBYTE_WRP;
//pOBInit.WRPArea = OB_WRPAREA_ZONE_A; // OB_WRPAREA_ZONE_A, OB_WRPAREA_ZONE_B , OB_WRPAREA_ZONE2_A, OB_WRPAREA_ZONE2_B
//pOBInit.WRPStartOffset = 0x7f;  //  zero based sector/page number
//pOBInit.WRPEndOffset = 0; 

 HAL_FLASH_Unlock();
 HAL_FLASH_OB_Unlock();
 while( rd32(R_FLASH_SR) & FLASH_SR_BSY1);  // wait until BSY1 is inactive before programming
 
// #define FLASH_WRP_START_MSK 0x7F
// #define FLASH_WRP_END_MSK   (0x7F << 16)
// 
//and32(R_FLASH_WRP1AR, ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));          // clear out start & end bits (but leave others unaffected)
//or32(R_FLASH_WRP1AR , data[0] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
//and32(R_FLASH_WRP1BR , ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));         // clear out start & end bits (but leave others unaffected)
//or32(R_FLASH_WRP1BR , data[1] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
//and32(R_FLASH_WRP2AR , ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));         // clear out start & end bits (but leave others unaffected)
//or32(R_FLASH_WRP2AR , data[2] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
//and32(R_FLASH_WRP2BR , ~(FLASH_WRP_START_MSK | FLASH_WRP_END_MSK));         // clear out start & end bits (but leave others unaffected)
//or32(R_FLASH_WRP2BR , data[3] & (FLASH_WRP_START_MSK | FLASH_WRP_END_MSK)); // write new start & end bits (but leave others unaffected)
 
 //and32(R_FLASH_WRP1AR, ~(FLASH_WRP1AR_WRP1A_STRT | FLASH_WRP1AR_WRP1A_END));          // clear out start & end bits (but leave others unaffected)
 //or32(R_FLASH_WRP1AR , data[0] & (FLASH_WRP1AR_WRP1A_STRT | FLASH_WRP1AR_WRP1A_END)); // write new start & end bits (but leave others unaffected)
 //and32(R_FLASH_WRP1BR , ~(FLASH_WRP1BR_WRP1B_STRT | FLASH_WRP1BR_WRP1B_END));          // clear out start & end bits (but leave others unaffected)
 //or32(R_FLASH_WRP1BR , data[1] & (FLASH_WRP1BR_WRP1B_STRT | FLASH_WRP1BR_WRP1B_END)); // write new start & end bits (but leave others unaffected)
 //and32(R_FLASH_WRP2AR , ~(FLASH_WRP2AR_WRP2A_STRT | FLASH_WRP2AR_WRP2A_END));          // clear out start & end bits (but leave others unaffected)
 //or32(R_FLASH_WRP2AR , data[2] & (FLASH_WRP2AR_WRP2A_STRT | FLASH_WRP2AR_WRP2A_END)); // write new start & end bits (but leave others unaffected)
 //and32(R_FLASH_WRP2BR , ~(FLASH_WRP2BR_WRP2B_STRT | FLASH_WRP2BR_WRP2B_END));          // clear out start & end bits (but leave others unaffected)
 //or32(R_FLASH_WRP2BR , data[3] & (FLASH_WRP2BR_WRP2B_STRT | FLASH_WRP2BR_WRP2B_END)); // write new start & end bits (but leave others unaffected)
 
