Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
 // TRY 16 BIT ACCESS
  
 //and16(R_FLASH_WRP1AR_STRT, (uint16_t)~(FLASH_WRP1AR_WRP1A_STRT));                    // clear out start bits (but leave others unaffected)
 //or16(R_FLASH_WRP1AR_STRT , (uint16_t)(data[0] & (FLASH_WRP1AR_WRP1A_STRT)));         // write new start bits (but leave others unaffected)
 //and16(R_FLASH_WRP1BR_STRT , (uint16_t)~(FLASH_WRP1BR_WRP1B_STRT ));                  // clear out start bits (but leave others unaffected)
 //or16(R_FLASH_WRP1BR_STRT , (uint16_t)(data[1] & (FLASH_WRP1BR_WRP1B_STRT)));         // write new start bits (but leave others unaffected)
 //and16(R_FLASH_WRP2AR_STRT , (uint16_t)~(FLASH_WRP2AR_WRP2A_STRT));                   // clear out start bits (but leave others unaffected)
 //or16(R_FLASH_WRP2AR_STRT , (uint16_t)(data[2] & (FLASH_WRP2AR_WRP2A_STRT)));         // write new start bits (but leave others unaffected)
 //and16(R_FLASH_WRP2BR_STRT , (uint16_t)~(FLASH_WRP2BR_WRP2B_STRT));                   // clear out start bits (but leave others unaffected)
 //or16(R_FLASH_WRP2BR_STRT , (uint16_t)(data[3] & (FLASH_WRP2BR_WRP2B_STRT)));         // write new start bits (but leave others unaffected)
 
 // wr16(R_FLASH_WRP1AR_STRT , (uint16_t)(data[0] & (FLASH_WRP1AR_WRP1A_STRT)));         // write new start bits (but leave others unaffected)
 // wr16(R_FLASH_WRP1BR_STRT , (uint16_t)(data[1] & (FLASH_WRP1BR_WRP1B_STRT)));         // write new start bits (but leave others unaffected)
 // wr16(R_FLASH_WRP2AR_STRT , (uint16_t)(data[2] & (FLASH_WRP2AR_WRP2A_STRT)));         // write new start bits (but leave others unaffected)
 // wr16(R_FLASH_WRP2BR_STRT , (uint16_t)(data[3] & (FLASH_WRP2BR_WRP2B_STRT)));         // write new start bits (but leave others unaffected)

//FLASH->WRP1AR = 0;  // neither changed
// works!
uint8_t* wrp1ar_strt_ptr = (uint8_t*)0x4002202C;
uint8_t* wrp1ar_end_ptr  = (uint8_t*)0x4002202E;
uint8_t* wrp1br_strt_ptr = (uint8_t*)0x40022030;
uint8_t* wrp1br_end_ptr  = (uint8_t*)0x40022032;
uint8_t* wrp2ar_strt_ptr = (uint8_t*)0x4002204C;
uint8_t* wrp2ar_end_ptr  = (uint8_t*)0x4002204E;
uint8_t* wrp2br_strt_ptr = (uint8_t*)0x40022050;
uint8_t* wrp2br_end_ptr  = (uint8_t*)0x40022052;

#define FLASH_WRP_MSK 0x0000007F   

*wrp1ar_strt_ptr = (uint8_t)(data[0] & FLASH_WRP_MSK); 
*wrp1ar_end_ptr  = (uint8_t)((data[0] >> 16) & FLASH_WRP_MSK); 
*wrp1br_strt_ptr = (uint8_t)(data[1] & FLASH_WRP_MSK); 
*wrp1br_end_ptr  = (uint8_t)((data[1] >> 16) & FLASH_WRP_MSK);
*wrp2ar_strt_ptr = (uint8_t)(data[2] & FLASH_WRP_MSK); 
*wrp2ar_end_ptr  = (uint8_t)((data[2] >> 16) & FLASH_WRP_MSK);
*wrp2br_strt_ptr = (uint8_t)(data[3] & FLASH_WRP_MSK); 
*wrp2br_end_ptr  = (uint8_t)((data[3] >> 16) & FLASH_WRP_MSK);


//FLASH_OBProgramInitTypeDef pOBInit ={0};
//HAL_FLASHEx_OBGetConfig(&pOBInit);
//
//pOBInit.OptionType = OPTIONBYTE_WRP;
//pOBInit.WRPArea = OB_WRPAREA_ZONE_A; // OB_WRPAREA_ZONE_A, OB_WRPAREA_ZONE_B , OB_WRPAREA_ZONE2_A, OB_WRPAREA_ZONE2_B
//pOBInit.WRPStartOffset = 0x2;  //  zero based sector/page number
//pOBInit.WRPEndOffset = 0x4; 
//
//HAL_FLASHEx_OBProgram(&pOBInit);
//
 or32(R_FLASH_CR , FLASH_CR_OPTSTRT);   //starts option byte programming
 while( rd32(R_FLASH_SR) & FLASH_SR_BSY1);  // wait until BSY1 is inactive
 or32(R_FLASH_CR , FLASH_CR_OBL_LAUNCH);  //sends system through reset which makes the new option bytes active.
 HAL_FLASH_OB_Lock();   // should never be executed
 HAL_FLASH_Lock();   // should never be executed

 return BL_OK;
}

void Bootloader_ConfigProtection_Save(uint32_t *data) {  
   /*           @arg @ref OB_WRPAREA_ZONE_A Flash Zone A
  *           @arg @ref OB_WRPAREA_ZONE_B Flash Zone B
  *           @arg @ref OB_WRPAREA_ZONE2_A Flash Bank 2 Zone A (*)
  *           @arg @ref OB_WRPAREA_ZONE2_B Flash Bank 2 Zone B (*)
  * @note  (*) availability depends on devices
  * @param  WRPStartOffset  Specifies the start page of the write protected area
  *         This parameter can be page number between 0 and (max number of pages in the Flash Bank - 1)
  * @param  WRDPEndOffset  Specifies the end page of the write protected area
  *         This parameter can be page number between WRPStartOffset and (max number of pages in the Flash Bank - 1)
  * @retval None
  */

  data[0] = rd32(R_FLASH_WRP1AR);
  data[1] = rd32(R_FLASH_WRP1BR);
  data[2] = rd32(R_FLASH_WRP2AR);
  data[3] = rd32(R_FLASH_WRP2BR);

}

void Bootloader_ConfigProtection_Clear(uint32_t *data) {  

  data[0] = 0x0000007F; // start > end so no protection
  data[1] = 0x0000007F; // start > end so no protection
  data[2] = 0x0000007F; // start > end so no protection
  data[3] = 0x0000007F; // start > end so no protection

}


// remove protection from application area
// protection of area before application is not changed
// protection of area beyond application not changed
//
// always returns success
uint8_t Bootloader_ConfigProtection_Keep_Boot(void) {  

  #define WITHIN(N,L,H)       ((N) >= (L) && (N) <= (H))
  uint32_t temp_wrp[4] = {0};
  
  if (app_size) {
    
    uint8_t first_app_page = (APP_ADDRESS - FLASH_BASE)/ FLASH_SECTOR_SIZE;
    uint8_t last_app_page = ((app_size/FLASH_SECTOR_SIZE) + first_app_page);
    if (app_size % FLASH_SECTOR_SIZE) last_app_page++;  // include partial page
    
    if (wrp1a_end >= wrp1a_strt) {
      // CASE A - wrp1a starts in app area
      if (WITHIN(wrp1a_strt, first_app_page, last_app_page)) {
        if ( wrp1a_end <= last_app_page) {  
      // CASE A1 - wrp1a entirely within application area
          temp_wrp[0] = 0x0000007F;         // disable wrp1a (set last < start)
        }
        else {
      // CASE A2 - wrp1a extends beyond application
          temp_wrp[0] = (last_app_page | (wrp1a_end << 16));  // application is partially within wrp1a
        }
      }  
      // CASE B - wrp1a starts before application
      else if (WITHIN(wrp1a_strt, 0, first_app_page -1)) {
        if (WITHIN(wrp1a_end, 0, first_app_page -1)) {
      // CASE B1 - wrp1a entirely before application area
           temp_wrp[0] = rd32(R_FLASH_WRP1AR);  // no change to wrp1a
           }
           else {
      // CASE B2 - wrp1a starts before application area but extends into application area
           temp_wrp[0] = wrp1a_strt | ((first_app_page - 1) << 16);  // wrp1a end to end of area before application
           }
         }
         else {
      // CASE C - wrp1a starts beyond the application so no changes needed
           temp_wrp[0] = rd32(R_FLASH_WRP1AR);  // no change to wrp1a
         }
    }  // end wrp1a

    
