Bob-the-Kuhn/bootloader_SPI/src/stm32-bootloader/bootloader.c
    if (wrp1b_end >= wrp1b_strt) {
      // CASE A - wrp1b starts in app area
      if (WITHIN(wrp1b_strt, first_app_page, last_app_page)) {
        if ( wrp1b_end <= last_app_page) {  
      // CASE A1 - wrp1b entirely within application area
          temp_wrp[0] = 0x0000007F;         // disable wrp1b (set last < start)
        }
        else {
      // CASE A2 - wrp1b extends beyond application
          temp_wrp[0] = (last_app_page | (wrp1b_end << 16));  // application is partially within wrp1b
        }
      }  
      // CASE B - wrp1b starts before application
      else if (WITHIN(wrp1b_strt, 0, first_app_page -1)) {
        if (WITHIN(wrp1b_end, 0, first_app_page -1)) {
      // CASE B1 - wrp1b entirely before application area
           temp_wrp[0] = rd32(R_FLASH_WRP1BR);  // no change to wrp1b
           }
           else {
      // CASE B2 - wrp1b starts before application area but extends into application area
           temp_wrp[0] = wrp1b_strt | ((first_app_page - 1) << 16);  // wrp1b end to end of area before application
           }
         }
         else {
      // CASE C - wrp1b starts beyond the application so no changes needed
           temp_wrp[0] = rd32(R_FLASH_WRP1BR);  // no change to wrp1b
         }
    }  // end wrp1b

 
    if (wrp2a_end >= wrp2a_strt) {
      // CASE A - wrp2a starts in app area
      if (WITHIN(wrp2a_strt + 128, first_app_page, last_app_page)) {
        if ( wrp2a_end + 128 <= last_app_page) {  
      // CASE A1 - wrp2a entirely within application area
          temp_wrp[0] = 0x0000007F;         // disable wrp2a (set last < start)
        }
        else {
      // CASE A2 - wrp2a extends beyond application
          temp_wrp[0] = ((last_app_page - 128) | (wrp2a_end << 16));  // application is partially within wrp2a
        }
      }  
      // CASE B - wrp2a starts before application
      else if (WITHIN(wrp2a_strt + 128, 0, first_app_page -1)) {
        if (WITHIN(wrp2a_end + 128, 0, first_app_page -1)) {
      // CASE B1 - wrp2a entirely before application area
           temp_wrp[0] = rd32(R_FLASH_WRP2AR);  // no change to wrp2a
           }
           else {
      // CASE B2 - wrp2a starts before application area but extends into application area
           temp_wrp[0] = wrp2a_strt | ((first_app_page - 1 - 128) << 16);  // wrp2a end to end of area before application
           }
         }
         else {
      // CASE C - wrp2a starts beyond the application so no changes needed
           temp_wrp[0] = rd32(R_FLASH_WRP2AR);  // no change to wrp2a
         }
    }  // end wrp2a 
    
 
    if (wrp2b_end >= wrp2b_strt) {
      // CASE A - wrp2b starts in app area
      if (WITHIN(wrp2b_strt + 128, first_app_page, last_app_page)) {
        if ( wrp2b_end + 128 <= last_app_page) {  
      // CASE A1 - wrp2b entirely within application area
          temp_wrp[0] = 0x0000007F;         // disable wrp2b (set last < start)
        }
        else {
      // CASE A2 - wrp2b extends beyond application
          temp_wrp[0] = ((last_app_page - 128) | (wrp2b_end << 16));  // application is partially within wrp2b
        }
      }  
      // CASE B - wrp2b starts before application
      else if (WITHIN(wrp2b_strt + 128, 0, first_app_page -1)) {
        if (WITHIN(wrp2b_end + 128, 0, first_app_page -1)) {
      // CASE B1 - wrp2b entirely before application area
           temp_wrp[0] = rd32(R_FLASH_WRP2BR);  // no change to wrp2b
           }
           else {
      // CASE B2 - wrp2b starts before application area but extends into application area
           temp_wrp[0] = wrp2b_strt | ((first_app_page - 1 - 128) << 16);  // wrp2b end to end of area before application
           }
         }
         else {
      // CASE C - wrp2b starts beyond the application so no changes needed
           temp_wrp[0] = rd32(R_FLASH_WRP2BR);  // no change to wrp2b
         }
    }  // end wrp2b 

  }  // app size
  return HAL_OK;
}



void save_WRP_state(void) {
  WRITE_Prot_Old_Flag = WRITE_Prot_Original_flag;  // flag that protection was saved
  Bootloader_ConfigProtection_Save(wrp_old);  // save the current write protection
}

void report_WP_ConfigProtection(void)
{
    
  if (wrp1a_end < wrp1a_strt) {
    kprint("BANK1 area A protection: none\n");
  }
  else {
    sprintf(msg,"BANK1 area A protection: %08lX", Bank1a_prot_start);
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank1a_prot_end);
    kprint(msg);
  }
  
  if (wrp1b_end < wrp1b_strt) {
    kprint("BANK1 area B protection: none\n");
  }
  else {
    sprintf(msg,"BANK1 area B protection: %08lX", Bank1b_prot_start);
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank1b_prot_end);
    kprint(msg);
  }
    
  if (wrp2a_end < wrp2a_strt) {
    kprint("BANK2 area A protection: none\n");
  }
  else {
    sprintf(msg,"BANK2 area A protection: %08lX", Bank2a_prot_start );
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank2a_prot_end);
    kprint(msg);
  }  
    
  if (wrp2b_end < wrp2b_strt) {
    kprint("BANK2 area B protection: none\n");
  }
  else {
    sprintf(msg,"BANK2 area B protection: %08lX", Bank2b_prot_start );
    kprint(msg);
    sprintf(msg," - %08lX\n", Bank2b_prot_end);
    kprint(msg);
  }  
    
}

/**
 * @brief  This function checks whether the new application fits into flash.
 * @param  appsize: size of application
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: if application fits into flash
 * @retval BL_SIZE_ERROR: if application does not fit into flash
 */
uint8_t Bootloader_CheckSize(uint32_t appsize)
{
    
    kprint("APP size: %8lX\n", appsize);
           
    return ((FLASH_BASE + FLASH_SIZE - APP_ADDRESS) >= appsize) ? BL_OK
                                                                : BL_SIZE_ERROR;
}

/**
 * @brief  This function verifies the checksum of application located in flash.
 *         If ::USE_CHECKSUM configuration parameter is disabled then the
 *         function always returns an error code.
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: if calculated checksum matches the application checksum
 * @retval BL_CHKS_ERROR: upon checksum mismatch or when ::USE_CHECKSUM is
 *         disabled
 */
uint8_t Bootloader_VerifyChecksum(void)
{
#if(USE_CHECKSUM)
    CRC_HandleTypeDef CrcHandle;
    volatile uint32_t calculatedCrc = 0;

    __HAL_RCC_CRC_CLK_ENABLE();
    CrcHandle.Instance                     = CRC;
    CrcHandle.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
    CrcHandle.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
    CrcHandle.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_NONE;
    CrcHandle.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLE;
    CrcHandle.InputDataFormat              = CRC_INPUTDATA_FORMAT_WORDS;
    if(HAL_CRC_Init(&CrcHandle) != HAL_OK)
    {
        return BL_CHKS_ERROR;
    }

    calculatedCrc =
        HAL_CRC_Calculate(&CrcHandle, (uint32_t*)APP_ADDRESS, APP_SIZE);

    __HAL_RCC_CRC_FORCE_RESET();
    __HAL_RCC_CRC_RELEASE_RESET();

    if((*(uint32_t*)CRC_ADDRESS) == calculatedCrc)
    {
        return BL_OK;
    }
#endif
    return BL_CHKS_ERROR;
}

/**
 * @brief  This function checks whether a valid application exists in flash.
 *         The check is performed by checking the very first DWORD (4 bytes) of
 *         the application firmware. In case of a valid application, this DWORD
 *         must represent the initialization location of stack pointer - which
 *         must be within the boundaries of RAM.
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: if first DWORD represents a valid stack pointer location
 * @retval BL_NO_APP: first DWORD value is out of RAM boundaries
 */
uint8_t Bootloader_CheckForApplication(void)
{
  return ((((*(uint32_t*)APP_ADDRESS) - RAM_BASE) <= RAM_SIZE) ? BL_OK : BL_NO_APP);
                                                                            
